# Programming Project

Introduction

In this project I will: 
1. Choose a real-world phenomenon that can be measured and for which I could collect at least one-hundred data points across at least four diï¬€erent variables.
2. Investigate the types of variables involved, their likely distributions, and their relationships with each other.   
3. Simulate a data set as closely matching their properties as possible. 
4. Detail my research and implement the simulation in this Jupyter notebook.

research - https://www.altexsoft.com/blog/datascience/preparing-your-dataset-for-machine-learning-8-basic-techniques-that-make-your-data-better/


In this excercise I will create a dataset that will demonstrate a sale of 20% on four types of shoes:
- sandals
- boots
- high heels
- runners

The variables that will be defined in the dataset is the size of the shoe, type of shoe, the original prize, 20% disocunt, the sale prize after the discount is taken away and the number of shoes left to sale during this sale.

include research on sheo sale?

In [182]:
#Libraries
#DataFrames in Python come with the Pandas library
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [183]:
data = pd.DataFrame(np.random.randn(10, 4), columns=list('abcd')) #expolring code that can be used for my datset
data #columns=list only generates 4 columns
#and random.randn is not a function I want

          a         b         c         d
0  0.329969 -0.547505 -1.177465 -1.899867
1 -0.817430 -0.927569 -0.548354 -1.464638
2  2.035173 -0.884703 -0.962674 -0.331027
3  0.950195  0.331453 -0.343477  0.624627
4 -0.091878  0.453995 -0.226912  0.185963
5 -0.022660 -0.263847 -0.168072  0.891783
6  0.982245 -1.125932  1.077117  0.644583
7  1.628192  0.977684  0.167998  0.003970
8  0.706777 -2.039531  0.456040 -0.999461
9  0.175577 -0.822758  1.255647 -0.224384

In [184]:
data = pd.DataFrame(np.random.randint(0,100,size=(10, 4)), columns=list('ABCD')) #randint accepts the size
# creates an output array of size (10,4) with random integer elements between (0,100)
data #still not exactly what I am looking for.
# I want each column to be named differently and have still relative data within its true range

    A   B   C   D
0  25   7  46  22
1  54  61  29  76
2   9  65  10  77
3   7  38  56  29
4  65  79  25  75
5  94  31  84  82
6   8  40  28  56
7  52  25   8  74
8   8  28  34  73
9  24  98  87  44

In [185]:
data = pd.DataFrame(np.random.randint(0,100,size=(10, 6)), columns=list('ABCDEF'))
data # more columns by increaing the size

    A   B   C   D   E   F
0   1  89  74  11  59  38
1  63   1  11  38  72  87
2  97  38  53  28  98  12
3  64  25  71  75  55  57
4  13  68  42  26  91  30
5  98   0  99  29  25  32
6   7  29   9  14  58  67
7  92  86  23  96  22  72
8  20  79  67  89  43  94
9  52  38  31  81  93  68

In [186]:
# now I want to name the columns
data = pd.DataFrame(np.random.randint(0,100,size=(10, 5)), columns=('shoe size','shoe type','months','brand', 'prize'))
data # what we have here is randomly generated numbers between 0 to 100
# Here we have 100 data points and 4 variables
# This is not exactly what I am looking for
# I think we need more numerical values and I need to define what I am lookign for.

   shoe size  shoe type  months  brand  prize
0         34         21      83     69     20
1         49         54       8     94     76
2         93         47       8     89     16
3         59         86      96     15     37
4         57         35      90     70     76
5         41         69      52     39     75
6         79          7      25     82     33
7         93         42      26     34     20
8         64         84      34     54     25
9         23         51      69     52     99

In [187]:
#Data will be randomly generated once teh code is ran so we can also seed it to have one dataset:
np.random.seed(100)
#Im going to focus on fist column first 'shoe size'
#As this is women size it starts from 35 to 42
#this is defining them at random but maybe i should set them from 35 to 43 
#this way I have a defined that size matters on the price and type?
dataseed = pd.DataFrame({"shoe_size": np.random.randint(35,43,100)}) 
#this generated random numbers between sizes 42 to 43[seeded]
#between smallest size of shoe 35 and largest 42.
dataseed.tail(10) #shows last 10 data points and to show the first 10 data .head

    shoe_size
90         38
91         40
92         41
93         35
94         40
95         36
96         39
97         37
98         38
99         41

In [188]:
#Im going to use randomly generated data for this Dataset:
data = pd.DataFrame({"shoe_size": np.random.randint(35,43,100)})

In [189]:
#Now I want to focus on the shoe type, this code will have to generate four different shoe types
#the shoe types I choosed is runners, sandals, high heels adn boots.
types = ['runners', 'sandals', 'boots', 'high_heels']

data = pd.DataFrame({"shoe_size": np.random.randint(35,43,100), "shoe_type": np.random.shuffle(types)})
data.head(10)
#I received an error on shoe_type
#I believe it is because the amount of times has to be identified and shuffle is not a correct function 
#random.shuffle

   shoe_size shoe_type
0         36      None
1         35      None
2         41      None
3         39      None
4         37      None
5         35      None
6         40      None
7         38      None
8         37      None
9         37      None

In [190]:
data = pd.DataFrame({"shoe_size": np.random.randint(35,43,100), "shoe_type": np.random.choice(types, 100)})
data.head(20)
#I used random choice as it allows multiple elements from a sequence with replacement (duplicates are possible)

    shoe_size   shoe_type
0          40     sandals
1          37  high_heels
2          35  high_heels
3          42  high_heels
4          35       boots
5          36     sandals
6          36     sandals
7          40       boots
8          42       boots
9          37  high_heels
10         38     sandals
11         41     runners
12         38     runners
13         36  high_heels
14         40     sandals
15         39  high_heels
16         40       boots
17         38  high_heels
18         37       boots
19         36     sandals

As I am concentrating on middle class range of shoes I checked a website called [Topshop](http://eu.topshop.com/en/tseu/category/shoes-485095/N-a2eZdgf?No=0&Nrpp=20&siteId=%2F13058&Nf=nowPrice%7CBTWN%2B5%2B195) which sells shoes and the prices vary from 5 euro to 195 euro. That is the range I will allocate for my shoes before the discount.

In [204]:
#randomly allocating a range of numbers between 5 euro and 195 euro.
dataprice = pd.DataFrame({"original_price": np.random.randint(5,195,100)}) 
dataprice.head(15)

    original_price
0               86
1               98
2              118
3               59
4              107
5               30
6              126
7              168
8              131
9               23
10              31
11             113
12              76
13              36
14             122

In [217]:
#now lets put it into the draft dataset:
data = pd.DataFrame({"shoe_size": np.random.randint(35,43,100), 
                     "shoe_type": np.random.choice(types, 100), "original_price": np.random.randint(5,195,100)})
data.head()

   shoe_size   shoe_type  original_price
0         42     runners              71
1         37       boots             167
2         42  high_heels              16
3         35       boots              57
4         39     sandals             102

In [218]:
#this column will show what is 20% dicount from the orginal prize
data['discount_20'] = data['original_price'] * 20 // 100 
data
data.head()

   shoe_size   shoe_type  original_price  discount_20
0         42     runners              71           14
1         37       boots             167           33
2         42  high_heels              16            3
3         35       boots              57           11
4         39     sandals             102           20

In [219]:
#this additional column will show the sale price after 20% discount is applied on the original price
#Here I researched how to subtract two columns in a dataframe
data['sale_price'] = data['original_price']-data['discount_20']
data.head()

   shoe_size   shoe_type  original_price  discount_20  sale_price
0         42     runners              71           14          57
1         37       boots             167           33         134
2         42  high_heels              16            3          13
3         35       boots              57           11          46
4         39     sandals             102           20          82

In [220]:
data['shoetype_available'] = data['shoe_type'].map({'sandals': 3, 'runners': 10, 'boots': 20, 'high_heels': 5})
#here I am trying to add a column that will show the amount left during this sale

In [221]:
data.loc[0:10, ['shoe_type', 'shoetype_available']]

     shoe_type  shoetype_available
0      runners                  10
1        boots                  20
2   high_heels                   5
3        boots                  20
4      sandals                   3
5      sandals                   3
6   high_heels                   5
7        boots                  20
8      sandals                   3
9   high_heels                   5
10     sandals                   3

In [222]:
#check the presentation of the dataset
data.head(20)

,shoe_size,shoe_type,original_price,discount_20,sale_price,shoetype_available
0,42,runners,71,14,57,10
1,37,boots,167,33,134,20
2,42,high_heels,16,3,13,5
3,35,boots,57,11,46,20
4,39,sandals,102,20,82,3
5,42,sandals,134,26,108,3
6,42,high_heels,95,19,76,5
7,37,boots,149,29,120,20
8,41,sandals,81,16,65,3
9,40,high_heels,181,36,145,5
10,39,sandals,51,10,41,3
11,38,high_heels,166,33,133,5
12,39,boots,189,37,152,20
13,41,boots,9,1,8,20
14,41,runners,136,27,109,10
15,41,boots,88,17,71,20
16,39,high_heels,179,35,144,5
17,42,high_heels,109,21,88,5
18,41,boots,97,19,78,20
19,39,high_heels,8,1,7,5

In [224]:
#just a quick check 
data.describe()

        shoe_size  original_price  discount_20  sale_price  shoetype_available
count  100.000000      100.000000   100.000000  100.000000          100.000000
mean    38.580000       95.770000    18.750000   77.020000            9.130000
std      2.370611       52.548747    10.509616   42.043743            6.374911
min     35.000000        8.000000     1.000000    7.000000            3.000000
25%     36.750000       55.750000    11.000000   44.750000            3.000000
50%     39.000000       93.500000    18.500000   75.000000            5.000000
75%     41.000000      135.250000    27.000000  108.250000           10.000000
max     42.000000      189.000000    37.000000  152.000000           20.000000

In [225]:
#shoes available in size 40 or above
data[data.shoe_size >=40]

,shoe_size,shoe_type,original_price,discount_20,sale_price,shoetype_available
0,42,runners,71,14,57,10
2,42,high_heels,16,3,13,5
5,42,sandals,134,26,108,3
6,42,high_heels,95,19,76,5
8,41,sandals,81,16,65,3
9,40,high_heels,181,36,145,5
13,41,boots,9,1,8,20
14,41,runners,136,27,109,10
15,41,boots,88,17,71,20
17,42,high_heels,109,21,88,5
18,41,boots,97,19,78,20
33,42,sandals,96,19,77,3
35,40,runners,61,12,49,10
36,42,runners,142,28,114,10
41,41,high_heels,132,26,106,5
45,40,boots,122,24,98,20
50,42,boots,185,37,148,20
51,40,sandals,161,32,129,3
53,40,high_heels,150,30,120,5
54,42,runners,107,21,86,10
55,42,sandals,22,4,18,3
56,41,runners,112,22,90,10
57,41,high_heels,61,12,49,5
59,40,boots,132,26,106,20
60,40,boots,113,22,91,20
63,41,high_heels,97,19,78,5
64,40,runners,58,11,47,10
65,42,high_heels,135,27,108,5
69,42,boots,142,28,114,20
71,40,runners,55,11,44,10
73,42,boots,115,23,92,20
79,42,boots,53,10,43,20
80,41,sandals,179,35,144,3
84,40,sandals,87,17,70,3
87,41,runners,32,6,26,10
91,42,sandals,119,23,96,3
92,40,boots,145,29,116,20
93,40,boots,63,12,51,20
97,41,sandals,56,11,45,3

In [223]:
#I want to focus only on twon columns
data.loc[0:10, ['shoe_size', 'original_price']]

    shoe_size  original_price
0          42              71
1          37             167
2          42              16
3          35              57
4          39             102
5          42             134
6          42              95
7          37             149
8          41              81
9          40             181
10         39              51

just thinking on possible analisis- you can compare the prices create some histogram amybe to show the graph on the sale. you can add a code that a shop keeper for example could use so if a custoemr is looking for a runners in size 36  you can see how many is in stock and the price of them.

http://pandas.pydata.org/pandas-docs/version/0.15/10min.html
https://www.youtube.com/watch?v=RlbO27N3Xg4

In [ ]:
https://www.shanelynn.ie/using-pandas-dataframe-creating-editing-viewing-data-in-python/

Remember, describe() method computes summary statistics of integer / double variables. To get the complete information about the data set, we can use info() function.

maybe add the price when your doing the analysis?

after you build it and when your making analyis you can use whats in this video
https://www.youtube.com/watch?v=F6kmIpWWEdU 
minute 13.0 just to show you only sizes ..

In [ ]:
mean of sizes
df['mean'] = df.mean(axis=1)

In [ ]:
#for the end analysis
#if I wan to see all th elements in on ecolumn 
data['shoe_type']

In [ ]:
#shoes available in size 40 or above
data[data.shoe_size >=40]

good youtibe videos on panda dataframe 
https://www.youtube.com/watch?v=P_q0tkYqvSk&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y&index=30

how to use function map https://stackoverflow.com/questions/23307301/pandas-replacing-column-values-in-dataframe

average price rage taken from website TOPSHOP http://eu.topshop.com/?geoip=home

pandas 
https://jeffdelaney.me/blog/useful-snippets-in-pandas/?fbclid=IwAR1RuqrP6AJowm6fAQJsCPqwtx1yg77e4drirjw8eEnKdBNpFMf5aDK_UPs